amirmovafagh/car-multimedia-mcu-stm32/Src/main.c
			if(areEqual(other, rx_buffer,0 , 3)){
				if(avTVinputState){
					
					
					
					HAL_GPIO_WritePin(switchRTDoutput_GPIO_Port, switchRTDoutput_Pin, GPIO_PIN_RESET);
					HAL_UART_Transmit (&huart1, (uint8_t*)"pion", 4, uart_timeout);
					avTVinputState = false;
				}else{
					avTVinputState = true;
					HAL_GPIO_WritePin(accRTDoutput_GPIO_Port, accRTDoutput_Pin, GPIO_PIN_SET);
					HAL_GPIO_WritePin(switchRTDoutput_GPIO_Port, switchRTDoutput_Pin, GPIO_PIN_SET);
					
					HAL_UART_Transmit (&huart1, (uint8_t*)"pof", 3, uart_timeout);
				}
				rx_index = 0;
				return;
      }
      
			//enable and disable debugmode
      if(areEqual(debug, rx_buffer,0 , 3)){
				if(debugState){
					debugState = false;
					HAL_UART_Transmit (&huart1, (uint8_t*)"dOff", 4, uart_timeout);
				}else{
					debugState = true;
					HAL_UART_Transmit (&huart1, (uint8_t*)"dOn", 3, uart_timeout);
				}
				rx_index = 0;
				return;
      }
      
      
			//RTD SECTION
      /*if(areEqual(rtd, rx_buffer,0 , 3)){
        
      }*/

      rx_index = 0;

    }
  }
}


bool areEqual(uint8_t arr1[], uint8_t arr2[], int i, int n){//compare two array
    // Linearly compare elements
    for (int a=i; a<n; a++){
         if (arr1[a] != arr2[a]){
						return false;
				 }
			 }         
    // If all elements were same.
    return true;
}
int arrayToInt(uint8_t mArr[]){ //for radio frq
  int b,o,n,m,k;
	
  if(mArr[1]==0x00){
    m = (mArr[0]-'0');
    k = m;
  }else if(mArr[2]==0x00){
		n = (mArr[0]-'0')*10;
    m = mArr[1]-'0';
    k = n+m;
	}else if(mArr[3]==0x00){
		o = (mArr[0]-'0')*100;
		n = (mArr[1]-'0')*10;
    m = mArr[2]-'0';
    k = o+n+m;	
	}else {
		b = (mArr[0]-'0')*1000;
		o = (mArr[1]-'0')*100;
		n = (mArr[2]-'0')*10;
    m = mArr[3]-'0';
    k = b+o+n+m;	
	}
  return k;
}

int arrayToInt_withIndex_soundValues(uint8_t mArr[],int index){//converting recived string data from android to INT for sound values
  int b,o,n,k;
	if(index == 0){
		b= (mArr[index]-'0')*10;
		o= (mArr[index+1]-'0');
		k=b+o;
		return k;
	}else {
		b= (mArr[index]-'0')*100;
		o= (mArr[index+1]-'0')*10;
		n= (mArr[index+2]-'0');
		k=b+o+n;
		return k;
	}
	
}

int arrayToInt_withIndex_radioValues(uint8_t mArr[],int index){//converting recived string data from android to INT for sound values
  int b,o,n,k,j;
	if(index == 0 || index == 7){
		k= (mArr[index]-'0');
		return k;
	}else {
		b= (mArr[index]-'0')*1000;
		o= (mArr[index+1]-'0')*100;
		n= (mArr[index+2]-'0')*10;
		j= (mArr[index+3]-'0');
		k=b+o+n+j;
		return k;
	}
	
}

bool checkDeviceI2cConnection(uint16_t DevAddress){//check I2c connection situation with i2c modules
	
	init=HAL_I2C_IsDeviceReady(&hi2c1,DevAddress,1,10);
	
	if(init == HAL_OK){
		return true;
	}else return false;
}



/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */



/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
	HAL_GPIO_WritePin( GPIOB, GPIO_PIN_14, GPIO_PIN_SET);


  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_USART1_UART_Init();
  MX_I2C1_Init();
  MX_USART2_UART_Init();
  MX_ADC1_Init();
  MX_IWDG_Init();
  MX_TIM2_Init();

  /* Initialize interrupts */
  MX_NVIC_Init();
  /* USER CODE BEGIN 2 */
	__HAL_IWDG_START(&hiwdg);
	HAL_ADC_Start_DMA(&hadc1,(uint32_t*) ADC_buffer, 2);
	
	//HAL_TIM_Base_Start_IT(&htim4);
	HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1); //start timer2 channel_1 as pwm
	TIM2->CCR1 = pwmValue;//pwm value from 0 to 65535

//__HAL_UART_ENABLE_IT(&huart1,UART_IT_TC);
 __HAL_UART_ENABLE_IT(&huart1,UART_IT_RXNE);//ssssssssssssssssssssssssssssssssssssssssssssssssssss
 __HAL_UART_ENABLE_IT(&huart2,UART_IT_RXNE);
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
	
	


	if(checkDeviceI2cConnection(soundModuleI2CAddress)){
		
		HAL_I2C_Master_Transmit(&hi2c1,soundModuleI2CAddress,pt2313_buffer,7, i2c_timeout);
}
 	
    
		HAL_UART_Transmit (&huart1, (uint8_t*)"RUN", 3, uart_timeout);
  while (1)
  {
		//HAL_Delay(30000); //check watchDog
		HAL_IWDG_Refresh(&hiwdg); //watch dog with down init 30 seconds need to reset
	
		carLightLampPinState = HAL_GPIO_ReadPin(GPIOA,lampDetectInput_Pin); //check car light_lamp state9
		reverseGearPinState = HAL_GPIO_ReadPin(GPIOA,rearCameraInput_Pin); //check reverse gear state
		acciPinState = HAL_GPIO_ReadPin(GPIOA,accInput_Pin); //check Switch On state

		if(acciPinState == GPIO_PIN_RESET)//GPIO_PIN_1
		{
			accState = true;
			HAL_GPIO_WritePin(headunitOutput_GPIO_Port, headunitOutput_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(headunitOutput_GPIO_Port, headunitOutput_Pin, GPIO_PIN_RESET);
			//HAL_GPIO_WritePin(accRTDoutput_GPIO_Port, accRTDoutput_Pin, GPIO_PIN_SET);	
			//HAL_GPIO_WritePin(switchRTDoutput_GPIO_Port, switchRTDoutput_Pin, GPIO_PIN_SET);
			HAL_GPIO_WritePin(standbySoundModuleAmpOutput_GPIO_Port, standbySoundModuleAmpOutput_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(muteOutput_GPIO_Port, muteOutput_Pin, GPIO_PIN_RESET);		
			HAL_GPIO_WritePin(power12V_GPIO_Port, power12V_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(powerUSBHub_GPIO_Port, powerUSBHub_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(amplifireOutput_GPIO_Port, amplifireOutput_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(fan_GPIO_Port,fan_Pin, GPIO_PIN_RESET);

		}else
		{
			accState = false;
			if(avCameraInputState){
				avCameraInputState = false;
				HAL_GPIO_WritePin(accRTDoutput_GPIO_Port, accRTDoutput_Pin, GPIO_PIN_SET);
				custom_delay(5000); //waiting for switch mode av to hdmi
			}else 
			{
				HAL_GPIO_WritePin(power12V_GPIO_Port, power12V_Pin, GPIO_PIN_SET);
			}
			
			//HAL_GPIO_WritePin(headunitOutput_GPIO_Port, headunitOutput_Pin, GPIO_PIN_SET);
			//HAL_GPIO_WritePin(accRTDoutput_GPIO_Port, accRTDoutput_Pin, GPIO_PIN_SET);	
			//HAL_GPIO_WritePin(switchRTDoutput_GPIO_Port, switchRTDoutput_Pin, GPIO_PIN_SET);
			HAL_GPIO_WritePin(standbySoundModuleAmpOutput_GPIO_Port, standbySoundModuleAmpOutput_Pin, GPIO_PIN_SET);
			HAL_GPIO_WritePin(muteOutput_GPIO_Port, muteOutput_Pin, GPIO_PIN_SET);		
			HAL_GPIO_WritePin(powerUSBHub_GPIO_Port, powerUSBHub_Pin, GPIO_PIN_SET);
			HAL_GPIO_WritePin(fan_GPIO_Port,fan_Pin, GPIO_PIN_SET);
			HAL_GPIO_WritePin(power12V_GPIO_Port, power12V_Pin, GPIO_PIN_SET);
		}

		if(accState){
			if(reverseGearPinState == GPIO_PIN_SET && !avTVinputState)
			{
				avCameraInputState = false;
				HAL_GPIO_WritePin(accRTDoutput_GPIO_Port, accRTDoutput_Pin, GPIO_PIN_SET);
			}else{
				avCameraInputState = true;
				HAL_GPIO_WritePin(accRTDoutput_GPIO_Port, accRTDoutput_Pin, GPIO_PIN_RESET); // with 0 switch will be on and set on AV
			}
			
			if(avTVinputState){
				if(reverseGearPinState == GPIO_PIN_SET )
				{
					avCameraInputState = false;
					//avTVinputState = false;
					HAL_GPIO_WritePin(switchRTDoutput_GPIO_Port, switchRTDoutput_Pin, GPIO_PIN_SET);//Switch from camera to tv 
				}else{
					avCameraInputState = true;
					HAL_GPIO_WritePin(switchRTDoutput_GPIO_Port, switchRTDoutput_Pin, GPIO_PIN_RESET); //Switch from tv to camera	
				}
			}
			if(carLightLampPinState == GPIO_PIN_RESET){ //check car light state and change the brightness
				carLightState = true;
				//custom_delay(1000);
				TIM2->CCR1 = pwmValueLightOn;
			}else {
				carLightState = false;
				TIM2->CCR1 = pwmValue;
			}
		}
	

  /* USER CODE END WHILE */

